Revit 2027 API
BuiltInFailures.GeometryFailures.PolygonSegmentTooShort Property
 Polygon segment too short
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PolygonSegmentTooShort { get; }
Public Shared ReadOnly Property PolygonSegmentTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PolygonSegmentTooShort {
	FailureDefinitionId^ get ();
}
static member PolygonSegmentTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace